use faradaylaser;
INSERT INTO Supplier(spl_name)
					 VALUES
                     ('索雷博光电科技有限公司'),
                     ('大恒光电科技有限公司'),
                     ('垂天科技有限公司');

INSERT INTO Staff(staff_name,staff_gender,staff_phone)
                       VALUES
                       ('陈昆昆','男','0000'),
                       ('吴晗坤','男','0000'),
                       ('王小博','男','0000'),
                       ('柯一睿','男','0000'),
                       ('樊馨丹','女','0000'),
                       ('吴晶','女','0000'),
                       ('黄美秀','男','0000'),
                       ('李琳琳','女','0000'),
                       ('李晓霞','女','0000'),
                       ('金瑶','女','0000'),
                       ('李敦庆','女','0000'),
                       ('李思远','男','0000'),
                       ('周海慧','女','0000'),
                       ('陈景标','男','0000'); 
                     

INSERT INTO Warehouse(whse_name,whse_home)
                       VALUES
                       ('超净间四号库房','温州'),
                       ('五号教学楼','北京'),
                       ('研发办公室B储物间','温州');
                       
INSERT INTO MaterialsSort(mat_sort_name,mat_sort_pid)
						VALUES
                        ('光学','0'),
                        ('机械','0'),
                        ('电路','0'),
                        ('镜架类','1'),
                        ('镜片类','1'),
                        ('激光管','1'),
                        ('隔离器','1'),
                        ('电光调制器（EOM）','1'),
                        ('小型化机箱','2'),
                        ('小型化原子泡机械部件','2');
                        
                       
INSERT INTO MaterialsCode(mat_code_number,mat_code_name,mat_code_spec,mat_code_model,mat_code_unit,mat_code_brand,mat_code_sort_id,mat_code_notes)
                       VALUES
                       ('129734758','混频器','无','ZFM-2-S+','个','索雷博','3','无'),
                       ('148634723','隔离器','无','IO-5-850-VLP','个','淘宝旗舰店','4','无'),
                       ('109237568','平凹透镜','852 D12.7 f=25.4','无','片','大恒光电','5','无'),
                       ('132807456','平凸透镜','852 D12.7 f=38.1','无','片','超达','6','无'),
                       ('123097534','光卡','无','VRC2','个','北京大学','7','无'),
                       ('121397543','扩束镜1','无','GBE05-B','个','光电','4','无'),
                       ('121397544','扩束镜2','无','BE052-B','个','三明誉洁','4','无'),
                       ('123098234','EOM','无','PM7-NIR-L61301','个','Qubig','5','无');
                       

INSERT INTO ProdProject(prod_proj_number,prod_proj_begin_date,prod_proj_end_date)
                       VALUES
                       ('TAIF190824','2018-11-23','2018-11-23'),
                       ('TAMST19113','2019-08-23','2018-11-25'),
                       ('TAIF190921','2018-04-21','2018-11-26'),
                       ('TAIF191012','2018-11-25','1000-01-01'),
                       ('TAPD190912','2018-05-13','1000-01-01'),
                       ('TAIF191112','2018-09-23','1000-01-01'),
                       ('FGEQ191234','2017-09-23','1000-01-01'),
                       ('TYIF196781','2019-09-23','2019-05-26');
	
INSERT INTO ProcProject(proc_number,proc_build_date,proc_end_date,proc_requester_id,proc_buyer)
						VALUES
                        ('FAEIU00001','2018-11-25','2018-12-05','1','2'),
                        ('FAER00002','2019-11-25','2018-12-05','1','2'),
                        ('FATY00003','2019-11-25','1000-01-01','2','2'),
                        ('ZXTE00004','2020-2-17','1000-01-01','2','2'),
                        ('ZXKD00005','2020-3-12','2020-3-19','2','2');
                        
INSERT INTO ItemState(item_state_name)
						VALUES
                        ('未购买'),
                        ('已购买'),
                        ('已到货'),
                        ('已入库'),
                        ('待检测'),
                        ('检测未通过');

INSERT INTO MaterialForm(mat_form_supplier_id,mat_form_buy_date,mat_form_proc_id)
						VALUES
                        ('1','2018-12-05','1'),
                        ('2','2018-11-05','2'),
                        ('3','2018-12-06','3'),
                        ('1','2018-12-07','4'),
                        ('2','2018-12-08','5'),
                        ('3','2018-12-09','1');

INSERT INTO Material(mat_code_id,mat_quantity,mat_price,mat_state_id,mat_notes,mat_item_id)
                       VALUES
                       ('1','2','4000.3','1','无','1'),
                       ('1','2','5230','1','无','1'),
                       ('1','2','12000','1','无','1'),
                       ('2','5','430','2','检测出异常等待售后处理','2'),
                       ('2','6','7694','2','到货一半剩下货物延迟到货','2'),
                       ('2','4','3200','2','无','2'),
                       ('3','5','3874','2','无','2'),
                       ('3','3','12397.23','3','无','3'),
                       ('4','4','42873','3','延期发货','3'),
                       ('4','3','28394','4','无','4'),
                       ('4','2','200','4','无','4'),
                       ('7','2','7600','3','无','3'),
                       ('8','2','34000','3','无','3'),
                       ('5','4','980','4','无','4'),
                       ('5','6','9000','4','无','4'),
                       ('6','5','2350','2','无','2'),
                       ('6','4','120','3','无','3'),
                       ('6','6','9530','1','无','1');
                       

INSERT INTO ContractForm(con_no,con_price,con_supplier_id,con_date,con_proc_id)
                       VALUES
                       ('JAHD190422','7300','1','2019-11-12','1'),
                       ('HKSKP19042205','4200','1','2019-11-23','2'),
                       ('QH-190425-33','23000.32','2','2019-09-23','3'),
                       ('RSCE2019012311','6800','2','2019-07-26','4'),
                       ('XCHY20190423','2100','3','2019-09-18','5'),
                       ('CHQ135711','126999.23','3','2019-12-25','2');
                       
INSERT INTO MaterialEqpt(mat_eqpt_serial,mat_id)
						VALUES
                        ('ER34564734','13');

INSERT INTO GodownEntry(gden_number,gden_whse_id,gden_whse_keeper_id,gden_in_date)
                       VALUES
                       ('123-972353','1','1','2019-06-07'),
                       ('274-435907','1','1','2019-08-12'),
                       ('384-123895','1','1','2019-11-07'),
                       ('901-237234','3','1','2019-12-12'),
                       ('490-324890','3','1','2019-02-18'),
                       ('923-423490','2','1','2019-03-23'); 


INSERT INTO Inventory(invt_code_id,invt_number,invt_whse_id)
                       VALUES
                       ('1','3','1'),
                       ('2','5','1'),
                       ('3','12','1'),
                       ('4','23','1'),
                       ('5','51','1'),
                       ('6','15','1'),
                       ('7','2','1'),
                       ('8','3','1'),
                       ('2','5','3'),
                       ('3','6','3'),
                       ('4','1','3'),
                       ('5','2','3');
